Naptick/Naphome-Korvo1/sdkconfig.defaults
CONFIG_LED_AUDIO_STRIP_GPIO=19
CONFIG_LED_AUDIO_LED_COUNT=12
CONFIG_LED_AUDIO_BRIGHTNESS=64
CONFIG_AUDIO_SAMPLE_RATE=44100
CONFIG_LOG_SWEEP_DURATION_SEC=5
CONFIG_LOG_SWEEP_START_FREQ=20
CONFIG_LOG_SWEEP_END_FREQ=20000
# Use 16MB flash (KORVO1 has 16MB flash)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# Use custom partition table to fit embedded WAV file
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=n
CONFIG_PARTITION_TABLE_SINGLE_APP=n

# Gemini API Configuration (from sample/voice assistant)
CONFIG_GEMINI_API_KEY="AIzaSyCjrdIBkpGWGXa4u9UileFFIMBZ_ZnMZ1w"
CONFIG_GEMINI_MODEL="gemini-2.5-flash"

# WiFi Configuration
CONFIG_WIFI_SSID="The Chateau"
CONFIG_WIFI_PASSWORD="thechateau"

# Set target to ESP32-S3 (Korvo1 has ESP32-S3, not ESP32)
CONFIG_IDF_TARGET="esp32s3"
